[
  {
    "id": "US001",
    "user_story": "As a Trip Treasurer, I want to create a new trip and easily add participants by their names, so that I can quickly set up our group's expense tracking without requiring everyone to sign up immediately.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am logged into TripSplit",
      "When I click 'Create New Trip', enter 'Europe Adventure', specify dates, and add 'Sarah', 'David', 'Emily' by name",
      "Then a new trip 'Europe Adventure' is created with Sarah, David, and Emily as participants",
      "And I am designated as the trip owner/admin"
    ]
  },
  {
    "id": "US002",
    "user_story": "As a Trip Treasurer, I want to quickly add a new expense with a description, amount, and payer, splitting it equally among all participants, so that all shared costs are immediately recorded and fairly distributed.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am on the 'Europe Adventure' trip dashboard",
      "When I click 'Add Expense', enter 'Dinner at Eiffel Tower', amount '$300', select 'Sarah' as payer, and choose 'Equal Split' for all participants",
      "Then the expense is added to the trip",
      "And each participant's balance is updated to reflect their equal share of the $300"
    ]
  },
  {
    "id": "US003",
    "user_story": "As a Transparent Traveler, I want to see my current balance (what I owe or am owed) in real-time, so that I can stay informed about my financial standing throughout the trip and avoid surprises.",
    "persona": "The Transparent Traveler",
    "acceptance_criteria": [
      "Given I am a participant in the 'Europe Adventure' trip",
      "When I view the trip dashboard or my personal balance screen",
      "Then I see an up-to-date net balance indicating if I owe money or am owed money",
      "And this balance updates instantly when new expenses are added or settled"
    ]
  },
  {
    "id": "US004",
    "user_story": "As a Trip Treasurer, I want to split an expense by custom amounts for each participant, so that I can accurately reflect varying contributions for specific items or situations.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am adding an expense for 'Souvenirs' with a total of '$100'",
      "When I select 'Custom Split' and assign 'Sarah $50', 'David $30', 'Emily $20'",
      "Then the expense is recorded with the custom amounts",
      "And each participant's balance is adjusted according to their specific contribution"
    ]
  },
  {
    "id": "US005",
    "user_story": "As a Transparent Traveler, I want to use the RAG chat interface to ask specific questions like 'What do I owe Sarah?', so that I can quickly get an accurate answer about my individual debts without navigating complex menus.",
    "persona": "The Transparent Traveler",
    "acceptance_criteria": [
      "Given I am on the 'Europe Adventure' trip screen",
      "When I open the RAG chat and type 'What do I owe Sarah?'",
      "Then the chat responds with my current outstanding debt to Sarah, if any"
    ]
  },
  {
    "id": "US006",
    "user_story": "As a Trip Treasurer, I want the application to recommend the fewest possible transactions to settle all outstanding debts, so that I can efficiently close out the trip's finances with minimal hassle for everyone.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given all expenses have been entered and balances are calculated for the 'Europe Adventure' trip",
      "When I navigate to the 'Settle Debts' section",
      "Then the system displays an optimized list of payments (e.g., 'David pays Sarah $X', 'Emily pays Sarah $Y') that clears all balances"
    ]
  },
  {
    "id": "US007",
    "user_story": "As a Transparent Traveler, I want to view a detailed list of all expenses for the trip, including who paid and how it was split, so that I can understand how costs are allocated and verify my share.",
    "persona": "The Transparent Traveler",
    "acceptance_criteria": [
      "Given I am a participant in the 'Europe Adventure' trip",
      "When I access the 'Expenses' list",
      "Then I can see each expense's description, total amount, the payer, the date, and how it was split among participants"
    ]
  },
  {
    "id": "US008",
    "user_story": "As an Easygoing Explorer, I want to receive a clear, simple summary of my final financial obligation at the end of the trip, so that I can settle up quickly without needing to delve into detailed expense tracking.",
    "persona": "The Easygoing Explorer",
    "acceptance_criteria": [
      "Given the 'Europe Adventure' trip is marked as complete and all expenses are settled",
      "When I view my personal trip summary or receive a notification",
      "Then I see a clear statement like 'You owe Sarah $X' or 'You are owed $Y'"
    ]
  },
  {
    "id": "US009",
    "user_story": "As a Trip Treasurer, I want to attach photos of receipts to expense entries, so that I have clear documentation for verification and can easily resolve any potential disputes.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am adding or editing an expense for 'Hotel Booking'",
      "When I select 'Attach Receipt' and upload a photo of the hotel bill",
      "Then the receipt image is linked to that expense and can be viewed by all trip participants"
    ]
  },
  {
    "id": "US010",
    "user_story": "As a Trip Treasurer, I want the system to automatically suggest expense categories based on the description, so that I can save time and ensure consistent organization without manual tagging.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am adding an expense",
      "When I enter the description 'Taxi to Airport'",
      "Then the system automatically suggests 'Transport' as the category",
      "And I can accept or override the suggested category"
    ]
  },
  {
    "id": "US011",
    "user_story": "As a Transparent Traveler, I want to mark a payment I've made to another participant as settled, so that my balance is updated immediately and I know my obligation is fulfilled.",
    "persona": "The Transparent Traveler",
    "acceptance_criteria": [
      "Given I have an outstanding debt to Sarah for $50",
      "When I pay Sarah $50 outside the app and mark the debt as settled in TripSplit",
      "Then my personal balance is updated to reflect the payment",
      "And Sarah's balance is also updated accordingly"
    ]
  },
  {
    "id": "US012",
    "user_story": "As a Trip Treasurer, I want to export a detailed expense report in PDF or CSV format, so that I have a comprehensive record for my personal finances or to share with the group for transparency.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given the 'Europe Adventure' trip has recorded expenses",
      "When I navigate to 'Reports' and select 'Detailed Expense List' and choose 'Export as PDF'",
      "Then a professional PDF document containing all trip expenses (description, amount, payer, split, category, date) is generated and available for download"
    ]
  },
  {
    "id": "US013",
    "user_story": "As an Easygoing Explorer, I want to be able to add an expense even when I don't have an active internet connection, so that I don't forget details and can record costs immediately, knowing they will sync later.",
    "persona": "The Easygoing Explorer",
    "acceptance_criteria": [
      "Given I am offline and on the 'Europe Adventure' trip screen",
      "When I add an expense 'Coffee', '$5', paid by 'Emily'",
      "Then the expense is saved locally and marked as pending synchronization",
      "And When I regain internet connection, Then the expense is automatically synced to the cloud and balances are updated for all participants"
    ]
  },
  {
    "id": "US014",
    "user_story": "As a Trip Treasurer, I want to use the RAG chat to ask 'How much did we spend on food?', so that I can quickly get insights into our spending patterns without manually filtering expenses.",
    "persona": "The Trip Treasurer",
    "acceptance_criteria": [
      "Given I am on the 'Europe Adventure' trip screen with various categorized expenses",
      "When I open the RAG chat and type 'How much did we spend on food?'",
      "Then the chat provides the total amount spent on expenses categorized as 'Food' for the trip"
    ]
  }
]