[
  {
    "id": "US001",
    "user_story": "As a Priya, the Hands-On PM, I want to create a new project with a name, client, start date, and duration in sprints, so that I can establish the project's basic framework and timeline.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I am on the main project dashboard,",
      "When I click the 'Create New Project' button,",
      "Then a form appears with fields for Project Name, Code, Client, Start Date, and Number of Sprints.",
      "When I fill in the details and enter '18' for the number of sprints,",
      "And I click 'Save',",
      "Then the new project is created, its timeline is set to 36 weeks, and I am taken to its allocation grid."
    ]
  },
  {
    "id": "US002",
    "user_story": "As a Priya, the Hands-On PM, I want to add an employee to my project by selecting them from a central list and assigning their Role, LCAT, and total Funded Hours, so that I can establish their budget cap for the project.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I am on the project allocation grid for 'Project Alpha',",
      "When I click the 'Add Employee' button,",
      "And I search for and select 'John Smith' from the employee list,",
      "Then a new row is added to the grid for John Smith.",
      "When I set his Role to 'SW Engineer', LCAT to 'Level 3', and Funded Hours to '1000',",
      "Then the row is saved, and the 'Remaining Hours' column for John shows '1000'."
    ]
  },
  {
    "id": "US003",
    "user_story": "As a Priya, the Hands-On PM, I want to allocate hours to an employee for a specific month by typing a number directly into the grid cell, so that I can quickly build my staffing plan in a familiar, spreadsheet-like interface.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given John Smith is on my project with 1000 funded hours,",
      "And I am viewing the allocation grid with monthly columns,",
      "When I click on the cell for John Smith under 'September 2024' and type '80',",
      "Then the cell value updates to '80' and the 'Total Allocated Hours' for John becomes '80'."
    ]
  },
  {
    "id": "US004",
    "user_story": "As a Priya, the Hands-On PM, I want the system to automatically calculate and display the FTE percentage in a cell as soon as I enter hours, so that I can immediately understand the workload I'm assigning without manual calculations.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given the standard full-time hours for September 2024 are calculated by the system as 168,",
      "And I have entered '84' hours for Jane Doe in the September 2024 cell,",
      "When I finish editing the cell,",
      "Then the cell instantly displays both '84 hrs' and '50% FTE' without requiring a page refresh."
    ]
  },
  {
    "id": "US005",
    "user_story": "As a Priya, the Hands-On PM, I want the 'Remaining Hours' cell for an employee to turn red and show a negative number if their total allocated hours exceed their funded hours, so that I am immediately alerted to a budget overrun.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given Jane Doe has 500 funded hours on my project,",
      "And she already has 450 hours allocated across several months,",
      "When I allocate another 80 hours to her in a new month,",
      "Then her 'Total Allocated Hours' column updates to '530',",
      "And the 'Remaining Hours' column updates to '-30' and its background color changes to red."
    ]
  },
  {
    "id": "US006",
    "user_story": "As a Priya, the Hands-On PM, I want to see a clear warning if my allocation causes an employee to exceed 100% FTE for a month across all their projects, so that I can avoid unknowingly over-booking a team member.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given Sarah is already allocated 100 hours (60% FTE) on 'Project Beta' for May,",
      "And I am staffing my 'Project Alpha',",
      "When I try to allocate 80 hours (48% FTE) to Sarah for May on 'Project Alpha',",
      "Then the cell for Sarah in May is flagged with a red warning icon.",
      "When I hover over the icon,",
      "Then a tooltip appears stating 'Warning: This allocation puts Sarah at 108% FTE for May across all projects.'"
    ]
  },
  {
    "id": "US007",
    "user_story": "As a Priya, the Hands-On PM, I want the ability to override the system-calculated full-time hours for a specific month on my project, so that I can account for unique project schedules or billing requirements.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given the system calculates 168 full-time hours for September based on business days,",
      "When I navigate to the project settings and find the 'Monthly Hours' configuration,",
      "And I override the September hours to '160',",
      "Then all FTE calculations for September on my project grid are now based on a denominator of 160 hours."
    ]
  },
  {
    "id": "US008",
    "user_story": "As a Priya, the Hands-On PM, I want the allocation grid cells to be color-coded in a heatmap style based on FTE percentage, so that I can get an at-a-glance understanding of team utilization.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I am viewing the project allocation grid,",
      "When a cell has an FTE between 1% and 40%, then it is colored light green.",
      "When a cell has an FTE between 81% and 100%, then it is colored dark green.",
      "When a cell has an FTE of 100%, then it is colored yellow.",
      "When a cell has an FTE over 100%, then it is colored red."
    ]
  },
  {
    "id": "US009",
    "user_story": "As a David, the Portfolio Overseer, I want to use a chat interface to ask 'What is John Smith's total allocation for Q4?', so that I can get quick answers without navigating through multiple project pages.",
    "persona": "David, the Portfolio Overseer",
    "acceptance_criteria": [
      "Given I am on the main dashboard,",
      "When I open the AI chat interface and type 'What is John Smith's total allocation for Q4?',",
      "Then the chat responds with a clear summary, such as 'John Smith is allocated for 480 hours in Q4 across Project Alpha (320 hrs) and Project Beta (160 hrs).'"
    ]
  },
  {
    "id": "US010",
    "user_story": "As a Maria, the Utilization Optimizer, I want to ask the AI assistant 'Show me all Cyber Analysts with less than 50% FTE in November', so that I can quickly identify available staff to fill new project needs.",
    "persona": "Maria, the Utilization Optimizer",
    "acceptance_criteria": [
      "Given I am using the AI chat interface,",
      "When I type 'Show me all Cyber Analysts with less than 50% FTE in November',",
      "Then the assistant returns a formatted list of employee names, their current FTE for November, and the projects they are assigned to."
    ]
  },
  {
    "id": "US011",
    "user_story": "As a David, the Portfolio Overseer, I want to view an organization-wide roll-up dashboard, so that I can see the total FTE by Role and a list of all over-allocated employees across my entire portfolio.",
    "persona": "David, the Portfolio Overseer",
    "acceptance_criteria": [
      "Given I am logged in as a Director,",
      "When I navigate to the 'Portfolio Dashboard',",
      "Then I see widgets displaying 'Overall FTE by Role', 'Over-allocated Employees', and 'Employees on the Bench'.",
      "When I see the 'SW Engineer' role is at 110% FTE,",
      "Then I can click on it to drill down and see a breakdown by project and employee."
    ]
  },
  {
    "id": "US012",
    "user_story": "As a Maria, the Utilization Optimizer, I want to view a single employee's timeline that shows all their project commitments on one screen, so that I can easily identify their availability and resolve scheduling conflicts.",
    "persona": "Maria, the Utilization Optimizer",
    "acceptance_criteria": [
      "Given I am on the employee database page,",
      "When I click on 'Sarah Jones',",
      "Then I am taken to a timeline view for Sarah Jones.",
      "When I look at the month of May,",
      "Then I see two distinct colored blocks representing her 60% allocation to 'Project Beta' and her 48% allocation to 'Project Alpha'."
    ]
  },
  {
    "id": "US013",
    "user_story": "As a Priya, the Hands-On PM, I want the AI agent to recommend suitable employees when I need to fill a role, so that I can staff my project faster with people who have the right skills and availability.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I have an unfilled 'Senior Developer' role on my project for Q3,",
      "When I click the 'Get Recommendations' button for that role,",
      "Then the AI agent suggests 3 employees, showing their name, current Q3 FTE, and relevant skills (e.g., 'David - 60% FTE, Skills: Python, AWS')."
    ]
  },
  {
    "id": "US014",
    "user_story": "As a Maria, the Utilization Optimizer, I want the AI agent to not only detect cross-project over-allocations but also suggest concrete resolutions, so that I can proactively solve resource conflicts.",
    "persona": "Maria, the Utilization Optimizer",
    "acceptance_criteria": [
      "Given Sarah has been allocated to 120% FTE in May,",
      "When I view the conflict alert on the dashboard,",
      "Then the AI agent presents actionable options like '1. Reduce Sarah's hours on Project Beta by 32 hours.' or '2. Reassign 32 hours of Sarah's work on Project Alpha to Mark, who is at 50% FTE.'"
    ]
  },
  {
    "id": "US015",
    "user_story": "As a David, the Portfolio Overseer, I want the AI agent to provide predictive resource forecasts, so that I can anticipate future hiring needs based on our project pipeline.",
    "persona": "David, the Portfolio Overseer",
    "acceptance_criteria": [
      "Given I am on the Portfolio Dashboard,",
      "When I view the 'Forecast' widget,",
      "Then I see a message like 'Based on planned projects, you will have a shortage of 3 Senior Developers in Q3. Consider hiring or cross-training.'"
    ]
  },
  {
    "id": "US016",
    "user_story": "As a David, the Portfolio Overseer, I want to export the project roll-up view to an Excel file, so that I can easily share the data with C-suite executives or perform my own custom analysis.",
    "persona": "David, the Portfolio Overseer",
    "acceptance_criteria": [
      "Given I am viewing the Portfolio Dashboard,",
      "When I click the 'Export to Excel' button,",
      "Then a .xlsx file is downloaded to my computer.",
      "When I open the file,",
      "Then the data and layout mirror the on-screen dashboard, with projects as rows and months as columns."
    ]
  },
  {
    "id": "US017",
    "user_story": "As a Priya, the Hands-On PM, I want to toggle the allocation grid's timeline between a monthly view and a sprint-based view, so that I can align my staffing plan with different planning needs.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I am viewing the allocation grid with columns for 'Jan', 'Feb', 'Mar',",
      "When I click the 'View by Sprints' toggle button,",
      "Then the columns change to 'Sprint 1', 'Sprint 2', 'Sprint 3', etc., with the allocated hours correctly distributed across the sprints."
    ]
  },
  {
    "id": "US018",
    "user_story": "As a Maria, the Utilization Optimizer, I want a settings area to define and manage a standardized list of Roles and LCATs, so that all PMs use consistent terminology, ensuring data accuracy for my roll-up reports.",
    "persona": "Maria, the Utilization Optimizer",
    "acceptance_criteria": [
      "Given I am logged in with administrative privileges,",
      "When I navigate to 'System Settings' -> 'Roles & LCATs',",
      "Then I see a list of existing roles.",
      "When I click 'Add New Role' and enter 'Data Scientist' and save,",
      "Then 'Data Scientist' becomes a selectable option for all PMs when they add an employee to a project."
    ]
  },
  {
    "id": "US019",
    "user_story": "As a Priya, the Hands-On PM, I want a project-specific dashboard that summarizes my total funded vs. allocated hours and shows a burn-down chart, so that I can quickly assess the staffing health of my project.",
    "persona": "Priya, the Hands-On PM",
    "acceptance_criteria": [
      "Given I am on my 'Project Alpha' page,",
      "When I click the 'Dashboard' tab,",
      "Then I see a summary metric 'Funded Hours: 5000 / Allocated Hours: 4850'.",
      "And I see a line chart showing the planned FTE burn-down over the project's timeline."
    ]
  },
  {
    "id": "US020",
    "user_story": "As a Maria, the Utilization Optimizer, I want the AI agent to suggest workload balancing opportunities, so that I can prevent employee burnout and maximize team efficiency.",
    "persona": "Maria, the Utilization Optimizer",
    "acceptance_criteria": [
      "Given I am viewing the Portfolio Dashboard,",
      "When the AI agent detects an imbalance,",
      "Then a suggestion appears, such as 'The SW Engineer team on Project Alpha has an average FTE of 95%, while the Cyber team is at 50%. Consider shifting non-specialized tasks to balance the load.'"
    ]
  }
]